Repository: kavancamp/subtitle-extractor-translator
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: bn, de, es, fr, hi, ja, ko, pt, pt_br, ru, ur, zh

source: is required for transcription.
de: ist für die Transkription erforderlich.
es: es necesaria para la transcripción.
fr: est nécessaire à la transcription.
ja: は転写に必要である。
ko: 는 전사에 필요합니다.
pt: é necessário para a transcrição.
pt_br: é necessário para a transcrição.
ru: требуется для транскрипции.
zh: 是转录所必需的。

source: Install it with:
de: Installieren Sie es mit:
es: Instálalo con:
fr: L'installer avec :
ja: でインストールする：
ko: 함께 설치하세요:
pt: Instale-o com:
pt_br: Instale-o com:
ru: Установите его с помощью:
zh: 用

source: ⚠️ Failed to write transcription:
de: ⚠️ Die Transkription konnte nicht geschrieben werden:
es: ⚠️ No se ha podido escribir la transcripción:
fr: ⚠️ Échec de la transcription :
ja: ⚠️ トランスクリプションの書き込みに失敗：
ko: ⚠️ 트랜스크립션 작성에 실패했습니다:
pt: ⚠️ Falha na transcrição:
pt_br: ⚠️ Falha ao escrever a transcrição:
ru: ⚠️ Не удалось записать транскрипцию:
zh: ⚠️ 转录失败：

source: 📖 Show this help and exit.
de: 📖 Diese Hilfe anzeigen und beenden.
es: 📖 Muestra esta ayuda y sal.
fr: 📖 Montrez cette aide et quittez.
ja: 📖 このヘルプを表示して終了する。
ko: 📖 이 도움말을 표시하고 종료합니다.
pt: 📖 Mostrar esta ajuda e sair.
pt_br: 📖 Mostre essa ajuda e saia.
ru: 📖 Покажите эту справку и выйдите.
zh: 📖 显示此帮助并退出。

source: 🌐 Interface language options:
de: 🌐 Optionen für die Sprache der Schnittstelle:
es: 🌐 Opciones de idioma de la interfaz:
fr: 🌐 Options de langue de l'interface :
ja: 🌐 インターフェース言語オプション：
ko: 🌐 인터페이스 언어 옵션:
pt: 🌐 Opções de idioma da interface:
pt_br: 🌐 Opções de idioma da interface:
ru: 🌐 Варианты языка интерфейса:
zh: 🌐 界面语言选项：

source: Defaults to English.
de: Die Standardeinstellung ist Englisch.
es: Por defecto en inglés.
fr: La valeur par défaut est l'anglais.
ja: デフォルトは英語。
ko: 기본값은 영어입니다.
pt: A predefinição é o inglês.
pt_br: O padrão é o inglês.
ru: По умолчанию - английский.
zh: 默认为英语。

source: ** Welcome to
de: ** Willkommen bei
es: ** Bienvenido a
fr: ** Bienvenue à
ja: ** ようこそ
ko: ** 에 오신 것을 환영합니다.
pt: ** Bem-vindo ao
pt_br: ** Bem-vindo ao
ru: ** Добро пожаловать в
zh: ** 欢迎来到

source: - Transcribe subtitles from video or audio
bn: - ভিডিও বা অডিও থেকে সাবটাইটেলগুলি প্রতিলিপি করুন
de: - Transkribieren von Untertiteln aus Video oder Audio
es: - Transcribir subtítulos de vídeo o audio
fr: - Transcrire les sous-titres d'une vidéo ou d'un fichier audio
hi: - वीडियो या ऑडियो से उपशीर्षक को ट्रांसक्राइब करें
ja: - ビデオやオーディオから字幕を書き起こす
ko: - 비디오 또는 오디오에서 자막 전사하기
pt: - Transcrever legendas de vídeo ou áudio
pt_br: - Transcrever legendas de vídeo ou áudio
ru: - Транскрибируйте субтитры с видео или аудио
ur: - ویڈیو یا آڈیو سے سب ٹائٹلز کی نقل
zh: - 从视频或音频转录字幕

source: Language hint for transcription
de: Sprachhinweis für die Transkription
es: Sugerencia lingüística para la transcripción
fr: Indication de langue pour la transcription
ja: 転写のための言語ヒント
ko: 트랜스 크립 션을 위한 언어 힌트
pt: Sugestão de língua para transcrição
pt_br: Dica de idioma para transcrição
ru: Языковая подсказка для транскрипции
zh: 转录语言提示

source: Output '.srt' file
de: Ausgabe der '.srt'-Datei
es: Archivo de salida '.srt
fr: Fichier de sortie '.srt
ja: .srt'ファイルを出力する
ko: 출력 '.srt' 파일
pt: Ficheiro '.srt' de saída
pt_br: Saída do arquivo ".srt".
ru: Выходной файл '.srt
zh: 输出".srt "文件

source: model size to use.
de: Modellgröße zu verwenden.
es: tamaño del modelo a utilizar.
fr: la taille du modèle à utiliser.
ja: 使用するモデルのサイズ。
ko: 사용할 모델 크기를 설정합니다.
pt: tamanho do modelo a utilizar.
pt_br: tamanho do modelo a ser usado.
ru: размер модели для использования.
zh: 使用的模型尺寸。

source: Options:
de: Optionen:
es: Opciones:
ja: オプション
ko: 옵션:
pt: Opções:
pt_br: Opções:
ru: Варианты:
zh: 选项：

source: Also write plain '.txt' (no numbering/timestamps).
de: Schreiben Sie auch einfache '.txt' (ohne Nummerierung/Zeitstempel).
es: Escriba también en formato '.txt' (sin numeración ni marcas de tiempo).
fr: Il est également possible d'écrire des fichiers '.txt' simples (sans numérotation ni horodatage).
ja: また、プレーンな'.txt'(ナンバリング/タイムスタンプなし)を書く。
ko: 또한 일반 '.txt'(번호 매기기/타임스탬프 없음)로 작성합니다.
pt: Escreva também um simples ".txt" (sem numeração/carimbos de data/hora).
pt_br: Escreva também um arquivo ".txt" simples (sem numeração/carimbo de data/hora).
ru: Также пишите обычные файлы '.txt' (без нумерации/меток времени).
zh: 也可写纯文本".txt"（无编号/时间戳）。

source: 🎙️ Transcribing
de: 🎙️ Transkribieren
es: 🎙️ Transcripción
fr: 🎙️ Transcription
ja: 🎙️ テープ起こし
ko: 🎙️ 트랜스크립션
pt: 🎙️ Transcrição
pt_br: 🎙️ Transcrição
ru: 🎙️ Транскрибирование
zh: 🎙️ 誊写

source: with language
de: mit Sprache
es: con el lenguaje
fr: avec la langue
ja: 言語で
ko: 언어 사용
pt: com a língua
pt_br: com o idioma
ru: с языком
zh: 用语言

source: to
de: zu
es: a
fr: à
ja: への
ko: 에
pt: para
pt_br: para
ru: на
zh: 至

source: ✅ Transcription complete.
de: ✅ Transkription abgeschlossen.
es: ✅ Transcripción completa.
fr: ✅ Transcription complète.
ja: ✅ テープ起こし完了。
ko: ✅ 전사가 완료되었습니다.
pt: ✅ Transcrição completa.
pt_br: ✅ Transcrição concluída.
ru: ✅ Транскрипция завершена.
zh: ✅ 转录完成。

source: 🧹 Clean transcript saved to
de: 🧹 Saubere Abschrift gespeichert in
es: 🧹 Transcripción limpia guardada en
fr: 🧹 Transcription propre sauvegardée dans
ja: 🧹 きれいな成績証明書は次の場所に保存される。
ko: 🧹 클린 성적증명서는 다음 주소로 저장됩니다.
pt: 🧹 Transcrição limpa guardada em
pt_br: 🧹 Transcrição limpa salva em
ru: 🧹 Чистая стенограмма сохраняется в
zh: 🧹 保存到

source: Subtitles saved to
de: Untertitel gespeichert in
es: Subtítulos guardados en
fr: Sous-titres enregistrés dans
ja: 字幕の保存先
ko: 자막 저장 위치
pt: Legendas guardadas em
pt_br: Legendas salvas em
ru: Субтитры сохраняются в
zh: 字幕保存到

source: - Extract subtitles from video; fallback to transcription
de: - Extrahieren von Untertiteln aus Videos; Rückgriff auf Transkription
es: - Extraer subtítulos de un vídeo; volver a la transcripción
fr: - Extraction de sous-titres à partir d'une vidéo ; retour à la transcription
ja: - ビデオから字幕を抽出し、文字起こしにフォールバックする
ko: - 비디오에서 자막 추출, 트랜스크립션으로 대체
pt: - Extrair legendas do vídeo; recorrer à transcrição
pt_br: - Extrair legendas do vídeo; retorno para transcrição
ru: - Извлечение субтитров из видео; возврат к транскрипции
zh: - 从视频中提取字幕；回退到转录

source: Output subtitle file name
bn: আউটপুট সাবটাইটেল ফাইলের নাম
de: Name der ausgegebenen Untertiteldatei
es: Nombre del archivo de subtítulos de salida
fr: Nom du fichier de sous-titres de sortie
hi: आउटपुट उपशीर्षक फ़ाइल नाम
ja: 出力字幕ファイル名
ko: 출력 자막 파일 이름
pt: Nome do ficheiro de legendas de saída
pt_br: Nome do arquivo de legenda de saída
ru: Имя файла выходных субтитров
ur: آؤٹ پٹ سب ٹائٹل فائل کا نام
zh: 输出字幕文件名

source: Language for fallback transcription
bn: ফ্যালব্যাক ট্রান্সক্রিপশন জন্য ভাষা
de: Sprache für Fallback-Transkription
es: Idioma de transcripción alternativa
fr: Langue pour la transcription de secours
hi: पतन प्रतिलेखन के लिए भाषा
ja: フォールバック転写の言語
ko: 폴백 트랜스 크립 션용 언어
pt: Língua para transcrição de recurso
pt_br: Idioma para transcrição de fallback
ru: Язык для резервной транскрипции
ur: فال بیک ٹرانسکرپشن کے لئے زبان
zh: 备用转录语言

source: model size to use
de: zu verwendende Modellgröße
es: tamaño del modelo a utilizar
fr: taille du modèle à utiliser
ja: 使用するモデルのサイズ
ko: 사용할 모델 크기
pt: tamanho do modelo a utilizar
pt_br: tamanho do modelo a ser usado
ru: размер модели для использования
zh: 使用的模型尺寸

source: (tiny, base, small, medium, large)
de: (klein, niedrig, klein, mittel, groß)
es: (diminuto, base, pequeño, mediano, grande)
fr: (minuscule, base, petit, moyen, grand)
ja: (タイニー、ベース、スモール、ミディアム、ラージ)
ko: (소형, 기본, 소형, 중형, 대형)
pt: (minúsculo, base, pequeno, médio, grande)
pt_br: (minúsculo, básico, pequeno, médio, grande)
ru: (крошечный, базовый, маленький, средний, большой)
zh: (微小、基本、小型、中型、大型)

source: Also write plain '.txt' (no timestamps or extra lines)
de: Schreiben Sie auch einfache '.txt' (ohne Zeitstempel oder zusätzliche Zeilen)
es: También escribir '.txt' sin formato (sin marcas de tiempo ni líneas adicionales)
fr: Il est également possible d'écrire un fichier '.txt' simple (sans horodatage ni lignes supplémentaires).
ja: また、プレーンな'.txt'(タイムスタンプや余分な行はない)を書く。
ko: 타임스탬프나 추가 줄 없이 일반 '.txt' 파일도 작성하세요.
pt: Escreva também '.txt' simples (sem carimbos de data/hora ou linhas extra)
pt_br: Também escreva '.txt' simples (sem registros de data e hora ou linhas extras)
ru: Также записывайте простой '.txt' (без временных меток и дополнительных строк).
zh: 也可写入纯文本".txt"（无时间戳或额外行数）

source: 🎬 Extracting subtitles from
de: 🎬 Extrahieren von Untertiteln aus
es: 🎬 Extracción de subtítulos de
fr: 🎬 Extraction de sous-titres à partir de
ja: 🎬 からの字幕抽出
ko: 🎬 다음에서 자막 추출
pt: 🎬 Extrair legendas de
pt_br: 🎬 Extração de legendas de
ru: 🎬 Извлечение субтитров из
zh: 🎬 提取字幕

source: ... to
de: ... zu
es: ... a
fr: ... à
ja: ... への
ko: ... 에
pt: ... para
pt_br: ... para
ru: ... на
zh: ... 至

source: 📺 Embedded subtitles found. Extracting with
de: 📺 Eingebettete Untertitel gefunden. Extrahieren mit
es: 📺 Se han encontrado subtítulos incrustados. Extrayendo con
fr: 📺 Sous-titres intégrés trouvés. Extraction avec
ja: 📺 埋め込まれた字幕が見つかりました。で抽出
ko: 📺 임베디드 자막이 발견되었습니다. 다음을 사용하여 추출
pt: 📺 Legendas incorporadas encontradas. Extrair com
pt_br: 📺 Legendas incorporadas encontradas. Extração com
ru: 📺 Найдены встроенные субтитры. Извлечение с помощью
zh: 📺 找到嵌入的字幕。使用

source: ✅ Subtitles saved to
de: ✅ Untertitel gespeichert in
es: ✅ Subtítulos guardados en
fr: ✅ Sous-titres enregistrés dans
ja: ✅ 字幕の保存先
ko: ✅ 자막 저장 위치
pt: ✅ Legendas guardadas em
pt_br: ✅ Legendas salvas em
ru: ✅ Субтитры сохраняются в
zh: ✅ 字幕保存到

source: ⚠️ Extraction failed. Falling back to transcription.
de: ⚠️ Extraktion fehlgeschlagen. Rückgriff auf die Transkription.
es: ⚠️ Extracción fallida. Volviendo a la transcripción.
fr: ⚠️ L'extraction a échoué. Retour à la transcription.
ja: ⚠️ 抽出に失敗。テープ起こしに戻る。
ko: ⚠️ 추출에 실패했습니다. 트랜스크립션으로 돌아갑니다.
pt: ⚠️ A extração falhou. Voltando à transcrição.
pt_br: ⚠️ A extração falhou. Retornando à transcrição.
ru: ⚠️ Извлечение не удалось. Возвращаемся к транскрипции.
zh: ⚠️ 提取失败。转回转录。

source: ⚠️ No embedded subtitles found. Using
de: ⚠️ Keine eingebetteten Untertitel gefunden. verwenden
es: ⚠️ No se han encontrado subtítulos incrustados. Utilizando
fr: ⚠️ Aucun sous-titre intégré n'a été trouvé. En utilisant
ja: ⚠️ 埋め込み字幕が見つかりません。使用中
ko: ⚠️ 삽입된 자막을 찾을 수 없습니다. 사용 중
pt: ⚠️ Não foram encontradas legendas incorporadas. Usando
pt_br: ⚠️ Não foram encontradas legendas incorporadas. Usando
ru: ⚠️ Встроенные субтитры не найдены. Использование
zh: ⚠️ 未找到嵌入式字幕。使用

source: for transcription.
de: für die Transkription.
es: para la transcripción.
fr: pour la transcription.
ja: 転写用
ko: 를 입력하세요.
pt: para transcrição.
pt_br: para transcrição.
ru: для транскрипции.
zh: 用于转录。

source: ✅ Fallback transcription complete.
bn: ✅ ফ্যালব্যাক ট্রান্সক্রিপশন সম্পূর্ণ।
de: ✅ Fallback-Transkription abgeschlossen.
es: ✅ Transcripción fallback completada.
fr: ✅ Transcription de repli terminée.
hi: ✅ फॉलबैक ट्रांसक्रिप्शन पूरा।
ja: ✅ フォールバック転写完了。
ko: ✅ 폴백 트랜스 크립 션 완료.
pt: ✅ Transcrição de recurso concluída.
pt_br: ✅ Transcrição de fallback concluída.
ru: ✅ Транскрипция обратного хода завершена.
ur: ✅ فال بیک ٹرانسکرپشن مکمل۔
zh: ✅ 回退转录完成。

source: - Translate subtitles and save to '.srt'
de: - Untertitel übersetzen und als '.srt' speichern
es: - Traducir subtítulos y guardarlos en '.srt'
fr: - Traduire les sous-titres et les enregistrer au format '.srt'.
ja: - 字幕を翻訳して'.srt'に保存する
ko: - 자막을 번역하고 '.srt'에 저장하기
pt: - Traduzir legendas e guardar em '.srt'
pt_br: - Traduzir legendas e salvar em '.srt'
ru: - Переведите субтитры и сохраните их в файле '.srt'.
zh: - 翻译字幕并保存为".srt

source: Target language
de: Zielsprache
es: Lengua de llegada
fr: Langue cible
ja: ターゲット言語
ko: 대상 언어
pt: Língua de chegada
pt_br: Idioma de destino
ru: Язык перевода
zh: 目标语言

source: Translated subtitle output file
bn: অনুবাদ সাবটাইটেল আউটপুট ফাইল
de: Übersetzte Untertitel-Ausgabedatei
es: Archivo de salida de subtítulos traducidos
fr: Fichier de sortie des sous-titres traduits
hi: अनुवादित उपशीर्षक आउटपुट फ़ाइल
ja: 翻訳済み字幕出力ファイル
ko: 번역된 자막 출력 파일
pt: Ficheiro de saída de legendas traduzidas
pt_br: Arquivo de saída da legenda traduzida
ru: Выходной файл переведенных субтитров
ur: ترجمہ شدہ سب ٹائٹل آؤٹ پٹ فائل
zh: 翻译字幕输出文件

source: 🌐 Translating
de: 🌐 Übersetzen
es: 🌐 Traducir
fr: 🌐 Traduire
ja: 🌐 翻訳する
ko: 🌐 번역
pt: 🌐 Traduzir
pt_br: 🌐 Tradução
ru: 🌐 Перевод
zh: 🌐 翻译

source: The
de: Die
es: En
fr: Le
ja: について
ko: 그리고
pt: O
pt_br: O
ru: Сайт
zh: "(《世界人权宣言》)

source: package is required for translation.
de: Paket ist für die Übersetzung erforderlich.
es: es necesario para la traducción.
fr: est nécessaire pour la traduction.
ja: パッケージは翻訳に必要である。
ko: 패키지가 번역에 필요합니다.
pt: é necessário para a tradução.
pt_br: é necessário para a tradução.
ru: пакет необходим для перевода.
zh: 软件包需要翻译。

source: ⚠️ Translation failed:
de: ⚠️ Die Übersetzung ist fehlgeschlagen:
es: ⚠️ La traducción falló:
fr: ⚠️ La traduction a échoué :
ja: ⚠️ 翻訳に失敗した：
ko: ⚠️ 번역에 실패했습니다:
pt: ⚠️ A tradução falhou:
pt_br: ⚠️ A tradução falhou:
ru: ⚠️ Перевод не удался:
zh: ⚠️ 翻译失败：

source: ✅ Translation complete. Saved to
de: ✅ Übersetzung abgeschlossen. Gesichert in
es: ✅ Traducción completa. Guardada en
fr: ✅ Traduction terminée. Sauvegardée sur
ja: ✅ 翻訳完了。保存先
ko: ✅ 번역 완료. 다음에 저장됨
pt: ✅ Tradução concluída. Guardada em
pt_br: ✅ Tradução concluída. Salvo em
ru: ✅ Перевод завершен. Сохранено в
zh: ✅ 翻译完成。保存到

source: ⚠️ Clean failed:
de: ⚠️ Clean ist gescheitert:
es: ⚠️ Ha fallado la limpieza:
fr: ⚠️ Le nettoyage a échoué :
ja: ⚠️ クリーンは失敗した：
ko: ⚠️ 청소에 실패했습니다:
pt: ⚠️ A limpeza falhou:
pt_br: ⚠️ Falha na limpeza:
ru: ⚠️ Чистота не удалась:
zh: ⚠️ 清洁失败：

source: - Clean an existing '.srt' or '.txt' into plain text
de: - Eine vorhandene '.srt' oder '.txt' in einfachen Text umwandeln
es: - Limpiar un archivo '.srt' o '.txt' existente en texto sin formato
fr: - Nettoyer un fichier '.srt' ou '.txt' existant en texte brut
ja: - 既存の'.srt'または'.txt'をプレーンテキストにクリーンアップする。
ko: - 기존 '.srt' 또는 '.txt' 파일을 일반 텍스트로 정리합니다.
pt: - Limpar um '.srt' ou '.txt' existente em texto simples
pt_br: - Limpar um arquivo '.srt' ou '.txt' existente em texto simples
ru: - Очистка существующего файла '.srt' или '.txt' в обычный текст
zh: - 将现有的".srt "或".txt "清除为纯文本

source: (no empty lines or timestamps).
de: (keine Leerzeilen oder Zeitstempel).
es: (sin líneas vacías ni marcas de tiempo).
fr: (pas de lignes vides ni d'horodatage).
ja: (空行やタイムスタンプはありません）。
ko: (빈 줄이나 타임스탬프 없음).
pt: (sem linhas vazias ou carimbos de data/hora).
pt_br: (sem linhas vazias ou registros de data e hora).
ru: (никаких пустых строк или временных меток).
zh: (无空行或时间戳）。

source: Output text file (defaults to input name with '.txt' extension)
de: Ausgabetextdatei (Standardwert ist der Eingabename mit der Erweiterung ".txt")
es: Archivo de texto de salida (por defecto es el nombre de entrada con extensión '.txt')
fr: Fichier texte de sortie (par défaut le nom de l'entrée avec l'extension '.txt')
ja: 出力テキストファイル (デフォルトは入力名で拡張子は '.txt')
ko: 출력 텍스트 파일(기본값은 '.txt' 확장자를 가진 입력 이름)
pt: Ficheiro de texto de saída (a predefinição é o nome de entrada com a extensão '.txt')
pt_br: Arquivo de texto de saída (o padrão é o nome de entrada com extensão '.txt')
ru: Выходной текстовый файл (по умолчанию используется имя входного файла с расширением '.txt')
zh: 输出文本文件（默认为扩展名为".txt "的输入名称）

source: Invalid input file:
de: Ungültige Eingabedatei:
es: Archivo de entrada no válido:
fr: Fichier d'entrée non valide :
ja: 無効な入力ファイルです：
ko: 잘못된 입력 파일입니다:
pt: Ficheiro de entrada inválido:
pt_br: Arquivo de entrada inválido:
ru: Недопустимый входной файл:
zh: 输入文件无效：

source: ⚠️ Failed to clean
de: ⚠️ Reinigung fehlgeschlagen
es: ⚠️ No se ha limpiado
fr: ⚠️ Le nettoyage n'a pas eu lieu
ja: ⚠️ クリーニングに失敗
ko: ⚠️ 청소 실패
pt: ⚠️ Falha na limpeza
pt_br: ⚠️ Falha na limpeza
ru: ⚠️ Не удалось очистить
zh: ⚠️ 清洁失败

source: Done.
de: Erledigt.
es: Hecho.
fr: Fait.
ja: 完了した。
ko: 완료되었습니다.
pt: Feito.
pt_br: Feito.
ru: Выполнено.
zh: 完成。

source: Invalid video format: '
de: Ungültiges Videoformat: '
es: Formato de vídeo no válido: '
fr: Format vidéo non valide : '
ja: 無効なビデオフォーマットです：'
ko: 잘못된 동영상 형식입니다: '
pt: Formato de vídeo inválido: '
pt_br: Formato de vídeo inválido: '
ru: Недопустимый формат видео: '
zh: 视频格式无效：'

source: '. Must be one of:
de: '. Muss eines der folgenden sein:
es: '. Debe ser uno de:
fr: '. Il doit s'agir de l'un d'entre eux :
ja: '. のいずれかでなければならない：
ko: '. 다음 중 하나여야 합니다:
pt: '. Deve ser um dos:
pt_br: '. Deve ser um dos seguintes:
ru: '. Должно быть, один из:
zh: '. 必须是

source: File must end with:
de: Die Datei muss mit enden:
es: El archivo debe terminar con:
fr: Le fichier doit se terminer par :
ja: ファイルの末尾は必ず
ko: 로 끝나야 합니다:
pt: O ficheiro deve terminar com:
pt_br: O arquivo deve terminar com:
ru: Файл должен заканчиваться на:
zh: 文件必须以

source: Error: No input file provided.
de: Fehler: Keine Eingabedatei vorhanden.
es: Error: No se ha proporcionado ningún archivo de entrada.
fr: Erreur : Aucun fichier d'entrée n'a été fourni.
ja: エラー：入力ファイルがありません。
ko: 오류입니다: 입력 파일이 없습니다.
pt: Erro: Não foi fornecido nenhum ficheiro de entrada.
pt_br: Erro: Nenhum arquivo de entrada fornecido.
ru: Ошибка: Не предоставлен входной файл.
zh: 错误：未提供输入文件。

source: 📄 File not found:
de: 📄 Datei nicht gefunden:
es: 📄 Archivo no encontrado:
fr: 📄 Fichier non trouvé :
ja: 📄 ファイルが見つかりません：
ko: 📄 파일을 찾을 수 없습니다:
pt: 📄 Ficheiro não encontrado:
pt_br: 📄 Arquivo não encontrado:
ru: 📄 Файл не найден:
zh: 📄 未找到文件：

source: Input file must end with: '.srt' or '.txt'
de: Eingabedatei muss enden mit: '.srt' oder '.txt' enden.
es: El archivo de entrada debe terminar en '.srt' o '.txt'.
fr: Le fichier d'entrée doit se terminer par : '.srt' ou '.txt'
ja: 入力ファイルの末尾は.srt' または '.txt' で終わること。
ko: 입력 파일의 끝은 '.srt' 또는 '.txt'로 끝나야 합니다.
pt: O ficheiro de entrada deve terminar com: '.srt' ou '.txt'
pt_br: O arquivo de entrada deve terminar com: '.srt' ou '.txt'
ru: Входной файл должен заканчиваться на: '.srt' или '.txt'
zh: 输入文件必须以.srt "或".txt

source: Output file must end with: '.txt'
de: Die Ausgabedatei muss mit: '.txt'
es: El archivo de salida debe terminar con '.txt'
fr: Le fichier de sortie doit se terminer par : '.txt'
ja: 出力ファイルの末尾は.txt'で終わること。
ko: 출력 파일은 반드시 '.txt'
pt: O ficheiro de saída deve terminar com: '.txt'
pt_br: O arquivo de saída deve terminar com: '.txt'
ru: Выходной файл должен заканчиваться на: '.txt'
zh: 输出文件必须以.txt "结尾

source: not found in PATH
de: nicht in PATH gefunden
es: no se encuentra en PATH
fr: introuvable dans le PATH
ja: PATHにない
ko: PATH에서 찾을 수 없음
pt: não encontrado no PATH
pt_br: não encontrado no PATH
ru: не найден в PATH
zh: 在 PATH 中找不到

source: **Interactive mode** Type 'help' or 'exit'.
bn: ** ইন্টারেক্টিভ মোড ** 'সহায়তা' বা 'প্রস্থান' টাইপ করুন।
hi: ** इंटरैक्टिव मोड ** टाइप 'हेल्प' या 'निकास'।
ur: ** انٹرایکٹو وضع ** قسم 'مدد' یا 'باہر نکلیں'۔

source: ❌ Failed to write transcription to {output}: {e}
bn: {আউটপুট}: {ই} এ প্রতিলিপি লিখতে ব্যর্থ
hi: {आउटपुट} पर प्रतिलेखन लिखने में विफल रहा: {ई}
ur: {آؤٹ پٹ}: {ای} میں نقل لکھنے میں ناکام

source: Interface language (bn, de, en, es, fr, haw, hi, hmn, ko, ru, ur). Defaults to English.
bn: ইন্টারফেস ভাষা (বিএন, ডি, এন, ইএস, এফআর, হা, এইচআই, এইচএমএন, কেও, আরইউ, ইউআর)। ইংরেজিতে ডিফল্ট।
hi: इंटरफ़ेस लैंग्वेज (Bn, de, en, es, fr, haw, hi, hmn, ko, ru, ur)। अंग्रेजी में चूक।
ur: انٹرفیس لینگویج (بی این ، ڈی ، این ، ایس ، ایف آر ، ہاؤ ، ہائے ، ایچ ایم این ، کو ، آر یو ، یو آر)۔ انگریزی سے پہلے سے طے شدہ۔

source: **Welcome to Subtitle Extractor & Translator CLI**
bn: ** সাবটাইটেল এক্সট্র্যাক্টর এবং অনুবাদক ক্লিতে স্বাগতম **
hi: ** सबटाइटल एक्सट्रैक्टर और ट्रांसलेटर क्लि ** में आपका स्वागत है
ur: ** سب ٹائٹل ایکسٹریکٹر اور مترجم CLI میں خوش آمدید **

source: Start an interactive shell (type 'exit' to quit)
bn: একটি ইন্টারেক্টিভ শেল শুরু করুন (প্রস্থান করতে 'প্রস্থান' টাইপ করুন)
hi: एक इंटरैक्टिव शेल शुरू करें (छोड़ने के लिए 'बाहर निकलें' टाइप करें)

source: Language model for transcription (e.g., en, es, zh).
bn: প্রতিলিপি জন্য ভাষা মডেল (উদাঃ, এন, এস, জেডএইচ)।
hi: प्रतिलेखन के लिए भाषा मॉडल (जैसे, एन, ईएस, जेडएच)।
ur: نقل کے لئے زبان کا ماڈل (جیسے ، EN ، ES ، ZH)۔

source: Output SRT file
bn: আউটপুট এসআরটি ফাইল
hi: आउटपुट SRT फ़ाइल
ur: آؤٹ پٹ ایس آر ٹی فائل

source: Whisper model size (tiny, base, small, medium, large, turbo)
bn: ফিসফিস মডেল আকার (ক্ষুদ্র, বেস, ছোট, মাঝারি, বৃহত, টার্বো)
hi: कानाफूसी मॉडल का आकार (छोटा, आधार, छोटा, मध्यम, बड़ा, टर्बो)
ur: سرگوشی کے ماڈل کا سائز (چھوٹا ، بیس ، چھوٹا ، درمیانے ، بڑا ، ٹربو)

source: Transcribing {video_path} with language {language} to {output}
bn: ভাষা {ভাষা} থেকে {আউটপুট} সহ {ভিডিও_পথ} প্রতিলিপি
hi: भाषा के साथ {Video_path} को {भाषा} से {आउटपुट} से ट्रांसक्राइब करना
ur: زبان {زبان {زبان} سے {آؤٹ پٹ} کے ساتھ {ویڈیو_پاتھ transcribing

source: Transcription complete.
bn: প্রতিলিপি সম্পূর্ণ।
hi: प्रतिलेखन पूरा।
ur: نقل مکمل.

source: Subtitles saved to {output} 📝
bn: সাবটাইটেলগুলি {আউটপুট} 📝 এ সংরক্ষণ করা হয়েছে
hi: उपशीर्षक {आउटपुट} को सहेजा गया
ur: سب ٹائٹلز {آؤٹ پٹ} 📝 پر محفوظ ہیں

source: - Extract subtitles from video; fallback to transcribed
bn: - ভিডিও থেকে সাবটাইটেলগুলি বের করুন; প্রতিলিপি ফ্যালব্যাক
hi: - वीडियो से उपशीर्षक निकालें; संक्रमण के लिए गिरावट
ur: - ویڈیو سے سب ٹائٹلز نکالیں۔ نقل کرنے کے لئے فال بیک

source: Whisper model size to use
bn: হুইস্পার মডেল আকার ব্যবহার করতে
hi: कानाफूसी मॉडल का आकार उपयोग करने के लिए
ur: استعمال کرنے کے لئے سرگوشی کے ماڈل کا سائز

source: 🎬 Extracting subtitles from {video_path}...
bn: {ভিডিও_পথ} থেকে সাবটাইটেলগুলি উত্তোলন করা ...
hi: {वीडियो_पाथ} से उपशीर्षक निकालने ...
ur: {ویڈیو_پاتھ} سے سب ٹائٹلز نکالنا ...

source: 📺 Embedded subtitles found. Extracting with ffmpeg...
bn: 📺 এমবেডেড সাবটাইটেলগুলি পাওয়া গেছে। Ffmpeg সঙ্গে উত্তোলন ...
hi: 📺 एम्बेडेड उपशीर्षक मिला। Ffmpeg के साथ निकालने ...
ur: sub سرایت شدہ سب ٹائٹلز ملے۔ ffmpeg کے ساتھ نکالنا ...

source: ✅ Subtitles extracted to {output}
bn: ✅ সাবটাইটেলগুলি {আউটপুট} এ নিষ্কাশিত
hi: } उपशीर्षक {आउटपुट} के लिए निकाला गया
ur: {سب ٹائٹلز {آؤٹ پٹ} پر نکالا گیا

source: ⚠️ Subtitle extraction failed. Falling back to transcription...{err}
bn: ⚠ সাবটাইটেল নিষ্কাশন ব্যর্থ হয়েছে। প্রতিলিপিতে ফিরে পড়া ... {ত্রুটি}
hi: ⚠ उपशीर्षक निष्कर्षण विफल रहा। प्रतिलेखन में वापस गिर रहा है ... {err}
ur: ⚠ سب ٹائٹل نکالنے میں ناکام رہا۔ نقل میں واپس گرنا ... {غلطی}

source: ⚠️ No embedded subtitles found. Using Whisper for transcription.
bn: ⚠ কোনও এমবেডেড সাবটাইটেল পাওয়া যায় না। প্রতিলিপি জন্য হুইস্পার ব্যবহার।
hi: ⚠ कोई एम्बेडेड उपशीर्षक नहीं मिला। प्रतिलेखन के लिए कानाफूसी का उपयोग करना।
ur: ⚠ ایمبیڈڈ سب ٹائٹلز نہیں ملا۔ نقل کے لئے سرگوشی کا استعمال کرتے ہوئے۔

source: - Translate subtitles and save to .srt
bn: - সাবটাইটেলগুলি অনুবাদ করুন এবং .srt এ সংরক্ষণ করুন
hi: - उपशीर्षक का अनुवाद करें और .srt को सहेजें
ur: - سب ٹائٹلز کا ترجمہ کریں اور .SRT میں محفوظ کریں

source: Target language (e.g., es, fr, de)
bn: লক্ষ্য ভাষা (উদাঃ, এস, এফআর, ডি)
hi: लक्ष्य भाषा (जैसे, ईएस, एफआर, डीई)
ur: ہدف زبان (جیسے ، ES ، FR ، DE)

source: Translating {srt_file} to {target_lang} -> {output}
bn: {Srt_file} থেকে {টার্গেট_ল্যাং} -> {আউটপুট} অনুবাদ করা
hi: अनुवाद {srt_file} से {target_lang} -> {आउटपुट}
ur: ترجمہ {srt_file} to {target_lang} -> {آؤٹ پٹ}

source: Invalid video format: '{ext}'. Must be one of: {', '.join(sorted(VALID_VIDEO_EXTENSIONS))}
bn: অবৈধ ভিডিও ফর্ম্যাট: '{এক্সট}'। অবশ্যই একটি হতে হবে: {','। জোয়াইন (বাছাই করা (বৈধ_ভিডিও_ এক্সটেনশনস))}
hi: अमान्य वीडियो प्रारूप: '{ext}'। में से एक होना चाहिए: {','।
ur: غلط ویڈیو فارمیٹ: '{ext}'۔ ان میں سے ایک ہونا ضروری ہے: {'،'. join (ترتیب دیا گیا (valid_video_extensions))}

source: ⚠️ ffprobe error: {e}
bn: ⚠ এফফপ্রোব ত্রুটি: {ই}
hi: ⚠ ffprobe त्रुटि: {E}
ur: ⚠ ffprobe غلطی: {e}

source: ⚠️ JSON decode error: {e}
bn: ⚠ জসন ডিকোড ত্রুটি: {ই}
ur: ⚠ JSON Decode غلطی: {E}

source: - Start an interactive shell (type 'exit' to quit)
ur: - ایک انٹرایکٹو شیل شروع کریں (چھوڑنے کے لئے 'باہر نکلیں' ٹائپ کریں)
