Repository: kavancamp/subtitle-extractor-translator
Catalog: locales/haw/messages.po
Languages: haw

source: currently available for the base cli language: 'bn', 'de', 'es', 'fr', 'haw', 'hi', 'ko','ru', 'ur', 'zh'. Defaults to English.
haw: Ke loaʻa nei i kēia manawa no ka hua'ōlelo CINANES: 'BN', '', ',' '', 'HU', 'HUW,' RH ',' OT ',' OR ',' O GH '. Hōʻalo i ka'ōlelo Pelekania.

source: **Welcome to Subtitle Extractor & Translator CLI**
haw: ** Welina i ka subtitle subtitle a me ka unuhiʻana cli **

source: - Transcribe subtitles from video or audio
haw: - ke kākau nei i nā subtitles mai ke wikiō a iʻole ka leo

source: Language model to use for transcription (e.g., bn, en, es,)
haw: Nā hiʻohiʻona'ōlelo e hoʻohana ai i ka hoʻololiʻana (e.g., Bn, en, es,)

source: output SRT file
haw: Pūnaewele Pūnaewele Srtput

source: Whisper model size to use - tiny, base, small, medium, large, turbo
haw: ʻO ka nui o keʻano hoʻohālike e hoʻohana ai - ka liʻiliʻi, kumu, liʻiliʻi, medium, nui,ʻo Turbo

source: Transcribing {video_path} with language {language} to {output}
haw: Ke kākauʻana {wikiō_path} me ka'ōlelo {'ōlelo {} i {puka}

source: Transcription complete.
haw: Ka palena palena.

source: Subtitles saved to {output} 📝
haw: Ua mālamaʻia nā '} iā {Kau} 📝

source: - Extract subtitles from video, fallback to transcribe if not
haw: - E wehe i nā subtitles mai ke wikiō, e kamaʻilio e kākau ai ināʻaʻole

source: Output subtitle file name
haw: ʻO ka inoa file combtitle file

source: Language for fallback transcription
haw: 'Lelo no keʻano o ke keleponaʻana

source: Whisper model size to use
haw: ʻO ka nui o ka hoʻohālike hoʻohālike e hoʻohana ai

source: 🎬 Extracting subtitles from {video_path}...
haw: 🎬 Ka hukiʻana i nā subtitles mai {wikiō_Path} ...

source: 📺 Embedded subtitles found. Extracting with ffmpeg...
haw: 📺 nā subtitles i loaʻa. Ka laweʻana me ffmpeg ...

source: ✅ Subtitles extracted to {output}
haw: ✅ subtitles i kiʻiʻia i ka {usput}

source: ⚠️ Subtitle extraction failed. Falling back to transcription...{err}
haw: ⚠️ subtitle exchation iʻole. Ke hāʻule nei i ka hoʻololiʻana ... {err}

source: ⚠️ No embedded subtitles found. Using Whisper for transcription.
haw: ⚠️ʻAʻole i loaʻa nā subtitles i loaʻa. Me ka hoʻohanaʻana i ka hawana no ka laweʻana.

source: ✅ Fallback transcription complete.
haw: ✅ Goveback transcription hoʻopau.

source: - Translate subtitles and save to .srt
haw: - unuhi i nā subtitles a hoʻopakele iā ia .srt

source: Target language to translate to (e.g., es, fr, de)
haw: 'Ōlelo i ka'ōlelo e unuhi i (e.g., es, fr, de)

source: Translated subtitle output file
haw: Unuhi i nā faila subtitle subtitle

source: Translating {srt_file} to {target_lang} -> {output}
haw: Unuhi {srt_file} i {pack_lang} -> {kau}

source: ⚠️ ffprobe error: {e}
haw: ⚠️ FFPPOBE ERROR:}

source: ⚠️ JSON decode error: {e}
haw: ⚠️ JSON DOWCE ERROR:}
