Repository: kavancamp/subtitle-extractor-translator
Catalog: locales/*/messages.po
Languages: de, es, fr, ko, ru

source: currently available for the base cli language: 'bn', 'de', 'es', 'fr', 'haw', 'hi', 'ko','ru', 'ur', 'zh'. Defaults to English.
de: Derzeit für die Basis -CLI -Sprache erhältlich: 'Bn', 'de', 'es', 'fr', 'haw', 'hi', 'ko', 'ru', 'ur', 'zh'. Standardmäßig Englisch.
es: Actualmente disponible para el lenguaje Base CLI: 'Bn', 'de', 'es', 'fr', 'Haw', 'Hi', 'Ko', 'Ru', 'Ur', 'Zh'. Predeterminado al inglés.
fr: Actuellement disponible pour la langue CLI de base: «bn», «de», «es», «fr», «haw», «hi», «ko», «ru», «ur», «zh». Par défaut en anglais.
ko: 현재 'Bn', 'de', 'es', 'fr', 'haw', 'hi', 'ko', 'ru', 'ur', 'zh'에 대해 현재 사용 가능합니다. 기본값으로 영어로.
ru: В настоящее время доступно для базового языка CLI: 'Bn', 'de', 'es', 'fr', 'haw', 'hi', 'ko', 'ru', 'ur', 'zh'. По умолчанию на английский.

source: **Welcome to Subtitle Extractor & Translator CLI**
de: ** Willkommen zum Untertitelextraktor & Übersetzer Cli **
es: ** Bienvenido al extractor y traductor de subtítulos **
fr: ** Bienvenue à l'extracteur et traducteur de sous-titre CLI **
ko: ** 자막 추출기 및 번역기 CLI에 오신 것을 환영합니다 **
ru: ** Добро пожаловать в субтитры экстрактора и переводчика CLI **

source: - Transcribe subtitles from video or audio
de: - Untertitel von Video oder Audio transkribieren
es: - Transcripción de subtítulos de video o audio
fr: - Transcrire les sous-titres de la vidéo ou de l'audio
ko: - 비디오 또는 오디오에서 자막 전사
ru: - транскрибировать субтитры из видео или аудио

source: Language model to use for transcription (e.g., bn, en, es,)
de: Sprachmodell für die Transkription (z. B. Bn, En, Es,) verwendet)
es: Modelo de lenguaje para usar para la transcripción (por ejemplo, BN, EN, ES,)
fr: Modèle linguistique à utiliser pour la transcription (par exemple, BN, EN, ES,)
ko: 전사에 사용할 언어 모델 (예 : BN, EN, ES,)
ru: Языковая модель для использования для транскрипции (например, Bn, en, es,)

source: output SRT file
de: SRT -Datei ausgeben
es: Archivo SRT de salida
fr: Sortie du fichier SRT
ko: 출력 SRT 파일
ru: Выход SRT -файл

source: Whisper model size to use - tiny, base, small, medium, large, turbo
de: Gebrauchsmodellgröße zu verwenden - winzig, Basis, klein, mittel, groß, Turbo
es: Tamaño del modelo de susurro para usar: pequeño, base, pequeño, mediano, grande, turbo
fr: Taille du modèle chuchotement à utiliser - minuscule, base, petit, moyen, grand, turbo
ko: 사용하는 속삭임 모델 크기 - 작은,베이스, 소규모, 중간, 대형, 터보
ru: Шепорный размер модели для использования - крошечный, базовый, маленький, средний, большой, турбо

source: Transcribing {video_path} with language {language} to {output}
de: Transkribieren {Video_Path} mit Sprache {Sprache} zu {output}}
es: Transcripción {video_path} con lenguaje {lenguaje} a {output}
fr: Transcription {video_path} avec le langage {langage} à {output}
ko: {video_path} {video_path}를 언어 {ancegry}로 {output}로 전사합니다.
ru: Транскрибирование {video_path} с языком {language} to {output}

source: Transcription complete.
de: Transkription vollständig.
es: Transcripción completa.
fr: Transcription complète.
ko: 전사 완료.
ru: Транскрипция завершена.

source: Subtitles saved to {output} 📝
de: Untertitel, die in {output} 📝 gespeichert sind
es: Subtítulos guardados en {salida} 📝
fr: Sous-titres enregistrés sur {output} 📝
ko: 자막은 {output} 📝에 저장되었습니다
ru: Субтитры сохранены в {выходе} 📝

source: - Extract subtitles from video, fallback to transcribe if not
de: - Untertitel aus Video extrahieren, fallback, um zu transkribieren, wenn nicht
es: - Extraer subtítulos del video, retroceso para transcribir si no
fr: - Extraire les sous-titres de la vidéo, se repliant pour transcrire sinon
ko: - 비디오에서 자막 추출, 그렇지 않은 경우 전사하기 위해 폴백
ru: - Извлеките субтитры из видео, запасной, транскрибировать, если нет

source: Output subtitle file name
de: Ausgabe der Untertiteldateiausgabe
es: Nombre del archivo del subtítulo de salida
fr: Nom du fichier de sous-titres de sortie
ko: 출력 자막 파일 이름
ru: Имя файла вывода

source: Language for fallback transcription
de: Sprache für Fallback Transkription
es: Idioma para la transcripción alternativa
fr: Langue pour la transcription de secours
ko: 폴백 전사 언어
ru: Язык для запасной транскрипции

source: Whisper model size to use
de: Flüstermodellgröße zu verwenden
es: Tamaño del modelo de susurro para usar
fr: Taille du modèle chuchotement à utiliser
ko: 사용할 모델 크기
ru: Шепорный размер модели для использования

source: 🎬 Extracting subtitles from {video_path}...
de: 🎬 Untertitel aus {Video_Path} ...
es: 🎬 Extracción de subtítulos de {video_path} ...
fr: 🎬 Extraction de sous-titres de {video_path} ...
ko: 🎬 {video_path}에서 자막 추출 ... ...
ru: 🎬 Извлечение субтитров из {video_path} ...

source: 📺 Embedded subtitles found. Extracting with ffmpeg...
de: 📺 Eingebettete Untertitel gefunden. Extrahieren mit ffmpeg ...
es: 📺 Subtítulos integrados encontrados. Extracción con ffmpeg ...
fr: 📺 Sous-titres intégrés trouvés. Extraction avec FFMPEG ...
ko: 📺 삽입 된 자막이 발견되었습니다. ffmpeg로 추출 ...
ru: 📺 Встроенные субтитры найдены. Извлечение с помощью ffmpeg ...

source: ✅ Subtitles extracted to {output}
de: ✅ Untertitel extrahiert an {output} extrahiert
es: ✅ Subtítulos extraídos a {salida}
fr: ✅ Sous-titres extraits à {Output}
ko: ✅ {output}에 추출 된 자막이 추출되었습니다.
ru: ✅ Субтитры извлечены в {выход}

source: ⚠️ Subtitle extraction failed. Falling back to transcription...{err}
de: ⚠️ Untertitelextraktion ist fehlgeschlagen. Zurück zur Transkription ... {err}
es: ⚠️ Falló la extracción de subtítulos. Regresando a la transcripción ... {err}
fr: ⚠️ L'extraction des sous-titres a échoué. Retomber à la transcription ... {err}
ko: ⚠️ 자막 추출이 실패했습니다. 전사로 돌아 가기 ... {err}
ru: ⚠ Извлечение подзаголовок не удалось. Возвращение к транскрипции ... {err}

source: ⚠️ No embedded subtitles found. Using Whisper for transcription.
de: ⚠️ Keine eingebetteten Untertitel gefunden. Mit Flüstern zur Transkription.
es: ⚠️ No se encontraron subtítulos incrustados. Usando Whisper para la transcripción.
fr: ⚠️ Aucun sous-titres intégrés trouvés. Utilisation de chuchotement pour la transcription.
ko: ⚠️ 내장 된 자막이 발견되지 않았습니다. 전사를 위해 속삭임 사용.
ru: ⚠ Внедренных субтитров не обнаружено. Используя шепот для транскрипции.

source: ✅ Fallback transcription complete.
de: ✅ Fallback Transkription vollständig.
es: ✅ Completa de transcripción de retroceso.
fr: ✅ Transcription de secours complète.
ko: 율 폴백 전사가 완료됩니다.
ru: ✅ Запасная транскрипция завершена.

source: - Translate subtitles and save to .srt
de: - Untertitel übersetzen und auf .srt speichern
es: - Traducir subtítulos y guardar a .srt
fr: - traduire les sous-titres et enregistrer sur .srt
ko: - 자막을 번역하고 .srt로 저장하십시오
ru: - Перевести субтитры и сохранить на .srt

source: Target language to translate to (e.g., es, fr, de)
de: Zielsprache zu übersetzen (z. B. Es, fr, de)
es: Lenguaje de destino para traducirse a (por ejemplo, ES, FR, DE)
fr: Langue cible pour traduire en (par exemple, ES, FR, DE)
ko: 번역 할 언어 (예 : Es, Fr, De)
ru: Целевой язык для перевода (например, ES, FR, DE)

source: Translated subtitle output file
de: Übersetzte Untertitel -Ausgabedatei
es: Archivo de salida de subtítulo traducido
fr: Fichier de sortie de sous-titre traduit
ko: 번역 된 자막 출력 파일
ru: Переведенный выходной файл подзаголовок

source: Translating {srt_file} to {target_lang} -> {output}
de: Übersetzen {srt_file} zu {target_lang} -> {output}}
es: Traducir {srt_file} a {target_lang} -> {output}
fr: Traduction {SRT_FILE} en {Target_lang} -> {Output}
ko: {srt_file}을 {target_lang} -> {output}로 변환합니다.
ru: Перевод {srt_file} to {target_lang} -> {output}

source: ⚠️ ffprobe error: {e}
fr: ⚠️ FFPROBE Erreur: {e}
ko: ⚠️ ffprobe 오류 : {e}
ru: ⚠ Ошибка ffprobe: {e}

source: ⚠️ JSON decode error: {e}
de: ⚠️ JSON -Dekodierfehler: {e}
fr: ⚠️ JSON Decode Erreur: {e}
ko: ⚠️ JSON DECODE 오류 : {e}
