Repository: kavancamp/subtitle-extractor-translator
Catalog: locales/hmn/messages.po
Languages: hmn

source: currently available for the base cli language: 'bn', 'de', 'es', 'fr', 'haw', 'hi', 'ko','ru', 'ur', 'zh'. Defaults to English.
hmn: Tam sim no muaj rau cov lus hauv paus: 'BN', 'ES', 'Faw', 'Ko', 'DH', 'Zh'. Ua txhaum rau Askiv.

source: **Welcome to Subtitle Extractor & Translator CLI**
hmn: ** Txais tos rau subtitle extractle extractor & transnel cli **

source: - Transcribe subtitles from video or audio
hmn: - Hloov cov subtitles los ntawm cov vis dis aus lossis suab

source: Language model to use for transcription (e.g., bn, en, es,)
hmn: Qauv lus los siv rau kev sau (E.g., BN, thiab, ES,)

source: output SRT file
hmn: Tso zis SRT cov ntaub ntawv

source: Whisper model size to use - tiny, base, small, medium, large, turbo
hmn: Ntxhi Model loj los siv - me me, puag, me me, nruab nrab, loj, turbo

source: Transcribing {video_path} with language {language} to {output}
hmn: Transcribing {video_pha} nrog lus {lus} rau {tso zis}

source: Transcription complete.
hmn: Kev sib sau ua ke tiav.

source: Subtitles saved to {output} 📝
hmn: Subtitles cawm rau {tso zis} 📝

source: - Extract subtitles from video, fallback to transcribe if not
hmn: - extract subtitles los ntawm cov vis dis aus, lub caij nplooj zeeg los theej tawm yog tias tsis yog

source: Output subtitle file name
hmn: Tso zis Subtitle cov ntaub ntawv npe

source: Language for fallback transcription
hmn: Lus rau Fallback Kev Sau Ntawv

source: Whisper model size to use
hmn: Ntxhi qauv loj siv

source: 🎬 Extracting subtitles from {video_path}...
hmn: 🎬 Muab rho cov ntawv hauv qab ntawm {video_pha} ...

source: 📺 Embedded subtitles found. Extracting with ffmpeg...
hmn: Embedded subtitles pom. Muab rho tawm nrog ffmpeg ...

source: ✅ Subtitles extracted to {output}
hmn: ✅ Subitles rho tawm rau {tso zis}

source: ⚠️ Subtitle extraction failed. Falling back to transcription...{err}
hmn: ⚠️ Subtitle rho tawm tsis tau. Poob rov qab rau kev sau ... {err}

source: ⚠️ No embedded subtitles found. Using Whisper for transcription.
hmn: ⚠️ tsis muaj cov subtitles pom. Siv lus ntxhi rau kev muab khoom.

source: ✅ Fallback transcription complete.
hmn: ✅ Lub neej ua tiav tiav.

source: - Translate subtitles and save to .srt
hmn: - Txhais cov subtitles thiab txuag rau .srt

source: Target language to translate to (e.g., es, fr, de)
hmn: Hom lus lus los txhais lus rau (E.g., es, fr, de)

source: Translated subtitle output file
hmn: Txhais cov ntawv sau cov ntawv sau tseg

source: Translating {srt_file} to {target_lang} -> {output}
hmn: Txhais {srt_file} rau {hom phiaj_lang} -> {tso zis}

source: ⚠️ ffprobe error: {e}
hmn: ⚠️ FFProbe Yuam Kev: {e}

source: ⚠️ JSON decode error: {e}
hmn: ⚠️ Json Decde Yuam Kev: {e}
